[    

    {
  "id": "post-oct-2",
  "date": "October 2, 2025",
  "title": "Waiting, Loving, and My Chaandni",
  "snippet": "U wait for minutes for someone u want, u wait hours for someone u trust and wait for someone knowing they wouldn't come back is someone u love. And I love u. Little more than yesterday but surely less than tomorrow.",
  "isArchived": false,
  "content": "2 October 2025\n\nheyy sweetheart today I heard something it was like U wait for minutes for someone u want, u wait hours for someone u trust and wait for someone knowing they wouldn't come back is someone u love. And I love u. Little more than yesterday but surely less than tomorrow .\n\nToday wasn't great purely because u came to my mind like dozens of times . When I watch the moon it reminds of me you, my chaandni. That smile of yours along with the subtle mardana voice of yours came to my mind baar baar. This isn't good I mean the ending I got.\n\nPata hai jis din tujhe rote hue sunna tha na BC mere dimag ka bhosda hi ho gaya tha.I mean i won't say ki u never cry in your life but I would say ki I would never be the reason for your tears. I am bad at consoling gurl so no rona dhona when u are with me.\n\nI don't know what's in your mind kya stereotype bana rakhi hai mere bare mein but this guy is evolving quite fast actually.I'm just hoping to become your pasandida mard billo. \n\nPata nahi yaar bahot jyada mann kar raha hai tere sath baat karne ka yesab hestitation ko goli marr ke But agar yaar ye karne se mein **ek man of words nahi rhunga but man of words se na tera mann bann na would be very important to me.\n\nMann to karta hai ki abhi tere pass jau aur teri gaal pakad ke puchu kyun babu why dont u like me then tu apni list sunane lag jayegi mein dukhi hoke teri godi mein so jaunga fir tu bhi apni fingers swirl karne lag jayegi mere baloon ke sath.\n\nhahahaha X2 \n\nbye I'mma study now .\ngood night."
},

    {
        "id": "post-oct-1",
        "date": "October 1, 2025",
        "title": "Anxious Detachment and Joji's Lyrics",
        "snippet": "Its not like Im dying to talk to u or hug u or to kiss u tightly. Its just my anxious detachment type love that's making me feel shit...",
        "isArchived": false,
        "content": "1 October 2025\n\nheyy hot-stuff, I hope everything's going great in your life. Its not like Im dying to talk to u or hug u or to kiss u tightly. Its just my anxious detachment type love thats making me feel shit and kind of reaching out to u telling all these stuff but I think I cant cuz I destroyed the the thing friendship for u in general and constantly made u sad for weeks. Gurl I really really wanted u not like u r an object but as a person to be with me respectfully.I really wanted to cross my arms and hug u tight for idk like billions of seconds. \n\n\nWaise dikhne mein to mein jyada sundar hunn terese but u get the point for being better than me in every aspect plus u had an amul cool wala mota dihh so udhar bhi jeet gayi. One thing for sure is I value u too much in general tu aur teri batein both. This is where Imma outshine u baby. Plus mujhe khana banana aata hai accha wala. \n\n \nyaar joji ke gane ka yaad aa gaya imma paste the lyrics just padh liyo ek baar\n\n[Verse 1]\nI don't want a friend\nI want my life in two (Please, one more night; my life in two)\nWaiting to get there\nWaiting for you (I done fighted all night; waiting for you)\n(I done fighted all night)\n\n[Pre-Chorus]\nWhen I'm around slow dancing in the dark\nDon't follow me, you'll end up in my arms\nYou done made up your mind\nI don't need no more signs\nCan you?\nCan you?\n\n[Chorus]\nGive me reasons we should be complete\nYou should be with him, I can't compete\nYou looked at me like I was someone else, oh well\nCan't you see? (Can you see?)\n\nIDK kya point hai ye sab likhne ka but i will stop soon.\n\nSojana tu bhi jaldi\nimma go sleep rn\n\nbyee"
    },
    {
        "id": "post-sep-30",
        "date": "September 30, 2025",
        "title": "Trashtalk Letters and the Lockdown Renaissance",
        "snippet": "Welcome to my trashtalk letters. Today Im gonna say summ stuff bout me what I fw and what are my wishes n stuff...",
        "isArchived": false,
        "content": "30 September 2025\n\nheyy duggu. Welcome to my trashtalk letters. Today Im gonna say summ stuff bout me what I fw and what are my wishes n stuff. Soch rahaan hunn ki ye wala hindi mein likhu cuz it describes how I mostly talk with u. So mera pura naam to tujhe pata hai. bachpan se 9th tak chodu baccha bass padhai aur phone chalana hi aata tha. Uske baad lockdown ho gaya I started to spend more time in my laptop and the internet we can say ki I was more inclined towards technology bachpan se hi but mera renaissance lockdown mein hi hua hai. Everything I am right now started back then and my downfall too. Padhai likhai ek dam chor hi diya tha ghanto ghanto baith ke videos edit kar raha hunn. Yeah kind of fucked my life from those times aur abhi college mein bhi yahi kar raha hunn. \n\nMein na hamesha se hi bass aj aur kal ke bare mein sochta hunn uske upar mera dimag jata hi nahi. Hamesha sochta hunn ki how can I get the best of today aur tere liye bhi waisa hi sochta tha aj kitni acchi batein hui hai hamri kal try karunga thoda aur karene ke liye but fir yaad aa jata hai jitna bhi baat kar lu ; this aint going anywhere cuz attraction can never be negotiated ya created its just happens \njaise mujhe hua tha. \n\nI hesitated bahot jyada summtimes even just replying u or talking with u was hurting me andar se.but honestly teresath baat karke bebaaq ho jana was normal for me. U know mein kuch jyada hi soch liya tha tbh mujhe pata تھا ki No hi ayega and I was cool with it but I wasnt ready for baad ki chizen. Mein to woh 0.111 % yes ki piche bhag raha tha, Gaana bhi soch liya tujhe instagram pe soft lunch karne ka apne story pe.\n\nI dont think ki bataya hunn mein but yaar jab tu apni caring side dikhati hai na bahot pyaar umad jata hai mera mann to karta hai gale se lagake pappiyan deta rahun and lock in my shit and to be better for everything. Ye movies aur series na mera dimag kharab kar rahke hein kuch jyada hi romanticize karne lag jata hunn normal si chiz ko. Often lagta hai this isnt a problem but summtimes i feel it is.\n\n\nbyee \nimma study now \nlove you\nlove u for everything my favorite kudi"
    },
    {
        "id": "post-sep-29",
        "date": "September 29, 2025",
        "title": "The 1 Hour, 41 Minute Fall",
        "snippet": "aj na teri bahot yaad aa rahi hai, bahot hi jyada. Do u remember our first call after I told u bout my feelings; it was bout 1 hr and 41 mins long...",
        "isArchived": false,
        "content": "29 September 2025\n\nheyy honey, aj na teri bahot yaad aa rahi hai, bahot hi jyada. But im workig my way out I remembered u didn't liked your childhood So imma try my hard to give u a decent adulthood where I can see u smile baby. \n\nDo u remember our first call after I told u bout my feelings; it was bout 1 hr and 41 mins long.\nI was completely overwhelmed baby I did not know what to talk about what to ask and how to respond but still u carried out the whole conversation. That was the day I completely fall for u babygurl. I forgot my boundaries I thought that u are cool bout it and I could have a chance to date u.\n\nshreya tu meri favorite gurl hai yaar mein kabhii socha bhi nahi tha ki mein trauma ban jaunga teri life ki ek. Mein just ye socha tha ki I will just be a good part of your life nothin else. But abhi ganda hate aa raha hai khud ke upar ki kya kar diya mene I compeletely nuked our friendship. I mean im just human too yaar 1st time kisise bina mile itna pyar ho gaya tha (yes pyaar, imma use that strong word) abhi bhi hai but this aint summthing u need to care about .\n\n\nI know no amount of these letters cant change the fundamental fact u aint see me that way. these are just collection of my thoughts i save every day just to write em. \n\nit hurts man, this not mutual stuff is really hard. But do u know whats more hard?\nmy dihh\nwhen i see ur picture \n(This dick-joke was included cuz of studio ka pressure to make mood light; writer has no power over them madam ji)\n\nAur sach batau billi mein na kahin se bhi block nahi kiyan hunn tujhe u can always reach me out. ye sach hai ki unfollow kar diya hunn tujhe har jagah se aur jo 2 precious photos tha woh delete kar diya hunn but block i aint.\nDaru nahi piya hunn na isiliye himmat nahi aa rahi ki kiss muh se wapas jaun. \nknock knock...\nkya mein aapki mental peace firse se bigadne aa jaun.\n\n\nim both happy and sad rn baby\nhappy isiliye ki teri batein sunn ni nahi padd raha\nAur sad isiliye ki aage kabhi sunn nahi paunga"
    },
    {
        "id": "post-sep-28",
        "date": "September 28, 2025",
        "title": "The 24-Hour Dream and a Fair Chance",
        "snippet": "You know I rarely give you compliments about your appearance and stuff, it's because I started with being friends, later I loved you more...",
        "isArchived": false,
        "content": "28 September 2025\n\nHey baby. I'm writing for you again. You know I rarely give you compliments about your appearance and stuff, it's because I started with being friends, later I loved you more, more as a lover. To whom everything about you seemed so perfect and enchanting. Your broad smile on that small dusky face of yours, revealing your gums, and that magic in your eyes always lifted my mood.\n\nAll I ever did is flaunting about me, telling shit, I never really cared for you. Never cared to ask about the stuff you like, your dreams, your favorite food, do you believe in monogamy or wanna go backpacking with me sometimes. Damn, I really messed up my part. Hotstuff, do you know what I always wanted to hear - \"hey Jyoti, you are a decent enough guy. You know that long distance is impractical. But we can surely try, try falling in love, spend afternoons together. I really don't feel anything for you now but I won't mislead you telling lies. Let me give you a fair try, let's see where it goes...\"\n\nLet me enlighten you how stupid and idiotic I am. I unfollowed you from every platform possible then deleted all chat and sms's. Had 2 screenshots of your posts on IG; one in that white top and pink flower ya aids ka symbol tha usme where you are smiling, and dusra in your green kurti (my heavens you look gorgeous baby) which I deleted too permanently. From morning to night, I'm just waiting for your notification, even though this time kahin se block nahi kiya hoon. I check my phone every half hour to see if your text has come. \n\nYou know, since my heart fell for you, all I’ve wanted is to listen to you. Your voice does something to me—it makes me feel warm, safe, and so incredibly nervous all at once. It makes my heart race, my palms sweat, and my mind go blank. It’s why my replies were always so clumsy; I was simply frozen by you big brain.\n\nI'm trying to forget you by learning new things and spending more time with family and all, but I remember you every time and when it happens, I literally break down. To forget you, I create a bitch image of you, that you probably talk to 10-12 guys, what difference would my leaving make, but then my rational brain works and says that's how you think about girls. Do you know u are my favorite homo sapien (in italic) after my immediate family. Family dekh you can't really choose, I was born to them and they have cared for me so much till now, so its obvious i will love them, but lover that I can really choose and that shit is different. So by that criteria you are at the top of my list, Billi. Aur tujhe kya lagta hai meri gaand nahi jalegi agar meri bandi kisi aur ladke ke sath ghume ya baat kare. Im possessive too for my woman.\n\nMy plan was that I would tell you everything straight and if something happened from your side too, then we would really be a kickass couple, but I couldn't understand your NO. Man I tried everyday hoping that maybe today something would happen, maybe she would start liking my presence. That thing which happens, the low probability thing, the 1% chance thing, I started chasing that, I forgot my aukat - not rich, not handsome, not tall, not wise. Just a mediocre man who found a woman he genuinely adores, and who would move heaven and earth for her happiness.(i read this line summwhere i dont remember rn, hope u understand the feeling )\n\nMein samjh gaya hunn, but I can't get over it. A dream comes to my mind that we are both together, just for 24 hours, in which I try to do everything to make this memorable, we had our breakfast, lunch, dinner, lots of talks, kisses, cuddles, and tons of sex along with other small gestures of love we both found cute in that small span. I know it sounds very filmy, but this dream is my sanctuary baby.\n\nByee Billi\nImma rest now\n\nyours always\nJyoti\n\nP.S. - I cried very hard, man, while writing all this, I'm still crying right now. It feels like someone is poking me with 100 needles at once, that too in the brain. This shit hurts, hurts more than being cheated on. I respect your decision, I do. To ask you to change it would make me a jerk, but your presence in my life is worth that risk. mummy kasam\n\nI don't know why you are punishing me for some other guy's actions. I'm sorry for what happened, but I'm not accountable for someone else's actions. So please baby, give me a fair chance first Let me prove myself to you. If after that, your heart still says no, I will accept it. But please, let me try."
    },
    {
        "id": "post-sep-27",
        "date": "September 27, 2025",
        "title": "A Quiet Day",
        "snippet": "heyy, me again.",
        "isArchived": false,
        "content": "27 September 2025\n\nheyy,\nme again. "
    },
    {
        "id": "post-sep-26",
        "date": "September 26, 2025",
        "title": "Solipsism, Cigarettes, and Predetermined Fate",
        "snippet": "Today I talked to her. I Sent her something she is never supposed to find out about but it was intentional... Gurl do u know about solipsism...",
        "isArchived": false,
        "content": "26 September 2025\n\nheyy Diary. Today I talked to her. I don't know why do I like her, so much .I Sent her something she is never supposed to find out about but it was intentional. I always wanted her to find out about this not cuz it would change any circumstance or situation . Our fate is predetermined so im just cherishing every moment with her. IDK whats the purpose of me writing all these but im gonnna write it everyday until i can. \n\n\nGurl do u know about solipsism. it says like everything outside of your mind is just a mere construct of your mind (stupid philosophical position btw) but even if everything is a mere imagination then u are the best i can come up with. I wanna know why i have this deep long for u babe? U are such a zesty bitch ( in a healthy way) but I liked u always. Not always as a lover its new for me too.\n\nher first thought was whether i had quit cigg or not?? like why , why do u even care. friends dont care that much. I mean yeah on the scale of frequency I talk to u much than others but they dont seem bothered after 5-6 times. I hate empathy from the beginning it make me fell like unworthy or summthing. \n\nshe shared me a picture of her thighs holy fuckin god; calling her body is tea is an understatement by itself. Like not a single strand of hair wasnt visible it looked like just one spank and its turning pink. arhhhhhhh ; so not me.. \n\nbut yeah gurl u are gorgeous even with that big ass chasma and that broad ass smile. Genuinely that that is surely in my top 3 laughs. I know every woman has a man she'll break all rules for but unfortunately i see excuses when u are talking to me , so yeah definitely Im not that man. But as I said I fuckin adore u so much and everything gotta end some day. So i was thinking of nothing..\n\nbyee \nlately \njyoti"
    },
    {
        "id": "post-sep-25",
        "date": "September 25, 2025",
        "title": "Grief is Love with Nowhere to Go",
        "snippet": "I keep thinking about that morning, the last ordinary one... They say grief is just love with nowhere to go. I think that’s true.",
        "isArchived": false,
        "content": "25 September,2025\n\nheyyy, I keep thinking about that morning, the last ordinary one. we were talking as usual, and I asked that question again to u , catching the replies made me what, pensive(i got summ good words babygurl, ty to my english madam bahot synonyms likhai thi). You were telling me about something I always feared and know of and that was so loud I just shattered at that instant. And I remember just watching your picture for the brief moment, struck by this overwhelming, simple thought: This is it. This is how it ends....\n\nI didn’t know I was memorizing it. I thought we had a lifetime left.\n\nThey say grief is just love with nowhere to go. I think that’s true. All this love I have for you, it’s still here, a constant, humming current in my chest. It has to go somewhere, so it turns into these memories, these pensive little visits to a past that grows more precious and more distant with each passing day.\n\nMy mind can't let u go. The world is coming back into focus, sharp and clear and without you in it. I’ll go to bed soon, on my side, and leave your side untouched. A space for a memory. A monument to a love that was, and in some quiet way, still is.\n\nGoodnight, babe.\n\nyours again\njyoti"
    },
    {
        "id": "post-sep-24",
        "date": "September 24, 2025",
        "title": "The Imagined First Meeting",
        "snippet": "I adore you darling and love u too, so much. I wont say im desperate but i just long for your presence baby.",
        "isArchived": true,
        "content": "24 September,2025\n\nI adore you darling and love u too, so much.And the unhealthy amount of times i imagined to listen it especially from you is an understatement. why does it feels like I would always be loving you till the end of my life knowing that it would hurt me, hurt me every single day.\n\n\nI wont say im desperate but i just long for your presence baby. Do u know what I had thought of like when Im gonna meet u for the first time its like firstly i will give a broad smile to u and then hold your cheeks in my palms and then a gentle kiss on your forehead. After that imma hug u for 30mins and then just leave without talking or saying anything. I just hate making up fake scenarios. It just shows my vulnerabilities.\n\n\nYou are right babe, Im not competent enough for u. Neither I have a dream of my own nor a purpose but nevertheless thank you for being the torch to guide me through.\n\nyours again\njyoti"
    },
    {
        "id": "post-sep-23",
        "date": "September 23, 2025",
        "title": "New Resolve and a Declaration",
        "snippet": "I want to tell you I love you. I want to love you. I will always love you... I find it hard to understand in my mind what it means to love you.",
        "isArchived": true,
        "content": "23 September,2025\n\nHeyy,sweetheart. I’m not sure how often you like hearing this, but I can’t help myself —writing to you fills me with warmth. I know the last conversation wasn’t the easiest, and I’m sure you’ll forgive me for it, because you understand how stubborn and foolish I can be. At the time, I thought there was no point in reaching out, but now I realize that I should have done this sooner. I want to tell you I love you. I want to love you. I will always love you. \n\n\nI find it hard to understand in my mind what it means to love you after you told me all that.But I still want to comfort and take care of you. And I want you to love me and care for me. I want to have problems to discuss with you I want to spend summ time with you.I never thought until now what i need to do and it sound something like Workkk. Imma stated learning whats required for me to be good in my field, hitting the gym daily in short takin good choices for long-run. \n\nSometimes I feel like can't I do something now just for u to acknowledge and recognize my love,ahhh ? \nNo, I guess.\n\n\n\nI am alone without you and you're the only idea of woman i truly admire. U know I have met summ girls, and very nice ones, And I don't want to remain alone. But, in 2 or 3 meetings, they all seem ashes. You only are left to me Billi. You are so real and practical with life (grounded bitch). I adore u much than I crave for you..\n\n\nAnd now, it is clearly even more true that you stand in my way of loving anyone else But I want you to stand there.\nYou, faraway, is so much better than anyone else up close. I know you will assure me that I am foolish and that you want me to have full happiness and don't want to be in my way but this is me the sad romantic u wasted summ years talking with.\n\njust yours\njyoti\n\nP.S.- I know i am not the man u ever wnated or else I can become one. But billi people change,ideas evolve and in the end everything fits together.🥰"
    }
]
